run/multiRegionDuineveldRisingBubble/baseMeshes/meshA/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh dynamicMotionSolverFvMesh;

twoDMotion yes;

motionPlaneNormal (1 0 0);

solver velocityLaplacian;

diffusivity quadratic inverseFaceDistance (interface);//inverseVolume;

/*solver laplace;*/

/*diffusivity quadratic;*/

/*distancePatches 2 (interface interfaceShadow);*/

nNonOrthogonalCorrectors 3;

distancePatches 2 (interface interfaceShadow);

frozenDiffusion no;

pseudoSolid
{
    poissonsRatio           0.3;
    nCorrectors             3;
    convergenceTolerance    1e-9;
};

// ************************************************************************* //
