run/multiRegionDuineveldRisingBubble/baseMeshes/meshA/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1-sfb1194                        |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
"proc.*"
{
	type	processor;
	value	uniform 0;
}
    space
    {
        type            zeroGradient;
    }
    interface
    {
        type                interfaceCoupledPressureValue;
        secondOrder         yes;
        nonOrthCorr         yes;
        neighbourRegionName meshB;
        neighbourPatchName  interfaceShadow;
        neighbourFieldName  p;
        k                   "rhoFluidA";
        value               uniform 0;
    }
    centerline
    {
        type            symmetryPlane;
    }
    upperWedge
    {
        type            wedge;
    }
    lowerWedge
    {
        type            wedge;
    }
}


// ************************************************************************* //
